<?php
$MESS['LM_AUTO_APIM_NO_BRAND_ID'] = 'ID бренда не может быть пустым и может содержать только символы A-Za-z0-9, символ подчёркивания и знак дефиса(минуса)';
$MESS['LM_AUTO_APIM_DUP_BRAND'] = "Бренд с таким ID уже существует";
$MESS['LM_AUTO_APIM_NO_BRAND_NAME'] = 'Название бренда не может быть пустым';
$MESS['LM_AUTO_APIM_NO_MODEL_ID'] = 'ID модели не может быть пустым  и может содержать только символы A-Za-z0-9, символ подчёркивания и знак дефиса(минуса)';
$MESS['LM_AUTO_APIM_NO_MODEL_NAME'] = 'название модели не может быть пустым';
$MESS['LM_AUTO_APIM_DUP_MODEL'] = "Модель с таким ID уже существует";
$MESS['LM_AUTO_APIM_NO_CAR_ID'] = 'ID модификации не может быть пустым и может содержать только символы A-Za-z0-9, символ подчёркивания и знак дефиса(минуса)' ;
$MESS['LM_AUTO_APIM_NO_CAR_NAME'] = 'Название модификации не может быть пустым';
$MESS['LM_AUTO_APIM_DUP_MODIF'] = "Такая модификация уже существует";

$MESS['LM_AUTO_APIM_NO_GROUP_NAME'] = 'Название группы не может быть пустым';
$MESS['LM_AUTO_APIM_NO_GROUP_ID'] = 'ID группы не может быть пустым и может содержать только символы A-Za-z0-9, символ подчёркивания и знак дефиса(минуса)';
$MESS['LM_AUTO_APIM_DUP_GROUP'] = "Такая группа уже существует";
$MESS['LM_AUTO_APIM_UNKNOWN_ENTITY_TYPE'] = 'Неизвестный тип сущности #TYPE#';

$MESS['LM_AUTO_APIM_NO_BRAND_OR_ARTICLE'] = 'Для создания детали необходимо указать её артикул и бренд';